# Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# Пример:
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

lst1 = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
srch1 = "qwe"
lst2 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
srch2 = "йцу"
lst3 = ["йцу", "фыв", "ячс", "цук", "йцукен"]
srch3 = "йцу"
lst4 = ["123", "234", 123, "567"]
srch4 = "123"
lst5 = []
srch5 = "123"

if srch1 in lst3:
    ind = lst3.index(srch3)
    for i in range(ind + 1, len(lst3)):
        if lst3[i] == srch3:
            print(i)
            break
    else:
        print(-1)
else:
    print(-1)
